// 연산자

// 1. 산술 연산자
// 수학 연산을 수행
// 종류 : 이항 산술 연산자, 단항 산술 연산자, 단항 부정 연산자

// 2. 대입 연산자와 복합 대입 연산자
// 대입 연산자 : 데이터 할당(대입)하는 연산을 수행
// 복합 대입 연산자 : 산술 연산자 + 대입 연산자, 산술과 할당을 한번에 수행하

// 3. 비교 연산자
// 피연산자를 비교한 뒤 논리형 값인 참, 거짓을 반환
// x == y : x와 y의 값이 같으면 true 반환
// x === y : x와 y의 값이 같고, 자료형도 같으면 true 반환
console.log(10 == "10"); //true
console.log(10 === "10"); //false

// 4. 논리 연산자
// 피연산자를 논리적으로 평가 후 조건에 맞는 피연산자 반환
// 종류 : &&, ||, !
// x && y : x가 참이면 y 반환, 거짓이면 x 반환
// x || y : x가 참이면 x 반환, 거짓이면 y 반환
// !x : x가 참이면 fause 반환, 거짓이면 true 반환

// 5. 삼항 연산자
// 세 항 중 가장 왼쪽의 피연산자 참, 거짓에 따라 나머지 두 피연산자를 선택적으로 반환
// x ? y : z 는 x가 참이면 y 반환, x가 거짓이면 z 반환

// 6. 모든 연산자에는 우선순위가 있다. (표 9-11 참고)

// 7. 형 변환 (데이터 자료형이 다른 자료형으로 바뀌는 것)



